# Задача 3: Вывести на экран числа от -N до N

def print_numbers(start,end):
    while start <= end:
        print (start)
        start+=1

print_numbers(-5,5)