# Задача 4: Показать первую цифру дробной части числа

n = float(input('Введите дробное число а '))

print(int((n*10)%10))